/*
 * 자바에서 제공하는 제어문: 필요한 내용만 출력, 반복수행, 반복제어
 * -----------------------연산자+제어문 = 메소드
 * 필요한 내용만 출력할 때 -> 조건문, 선택문 (다중조건문과 동일)
 * 반복수행 문장 -> for, while, do~while
 * 반복제어 -> 종료(break), 제외(continue)
 * 
 * 1) 조건문 : 사용빈도가 가장 많다.
 *       => 단일조건문 : 검색할 때 검색어 입력여부 확인, 상세보기에 사용
 *                  형식) if(조건문){
 *                                   조건이 true 일 때만 수행 => false면 스킵
 *                               }
 *                         * 조건문은 무조건 true/false만 나와야 한다. 
 *                                      => 부정연산자, 비교연산자, 논리연산자 이용
 *                                            
 *       => 선택조건문
 *       => 다중조건문
 * 
 * 
 */
public class 제어문_선택문_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
		
		
	}

}
