package com.sist.main;
/*
 *    상속
 *     = 키워드  : extends
 *     = 객체 생성
 *        -------
 *         하위클래스 = 하위클래스 -> 상위클래스를 확장
 *         
 *  => 상속 받는 클래스와 상속을 내리는 클래스는 공통성이 많다.
 *  => 상속 받는 클래스는 수정/추가가 가능하다 ==> 수정 - 오버라이딩 / 추가 - 오버로딩
 *  
 *  ** 객체지향 프로그램 특징
 *      1) 데이터를 보호한다 (캡슐화)
 *      2) 기존의 클래스를 재사용한다 (상속)
 *      3) 추가, 수정이 가능하게 만든다 (다형성) ((ex)오버로딩, 오버라이딩)
 *      ---------------------------------------------------------- => 6장   
 */

public class MainClass_6 {

	public static void main(String[] args) {
		
	}
}
