/*
 * 1. 변수 선언
 *    1) 변수 : 1개의 데이터를 저장하는 메모리 공간의 이름 (주소 대신에, 메모리 어디에 저장될 지 모르기 때문에 이름 필요, 저장한 데이터 읽기 쓰기 편하기 위해)
 *          => 데이터 변경이 가능/ 데이터형이 있으면 선언한다는 것을 의미
 *          
 *    2) 상수 : 1개의 데이터를 저장하는 메모리 공간 이름
 *          => 데이터 변경이 불가능 
 *          -> 변수와 상수의 구분은 final 로 함.
 *          => 표현형식 : final 데이터형 상수명 = 값 -> 값을 고정하는 것 
 *          
 *    3) 리터럴 : 실제 저장된 값(메모리)
 *    
 * 2. 변수 명칭법 => 식별자 => 같은 곳에서 같은 이름의 변수는 사용이 불가능하다.
 *    => 알파벳이나 한글로 시작 (대소문자 구분)
 *    
 * 3. 데이터형(타입), 기본형 ==> 27page
 *      형식)
 *      데이터타입 변수명;
 *      ----------------정수, 실수, 문자, 논리
 *      ------------------------------------
 *      정수형
 *      -----------------------------------
 *      논리형
 *      -----------------------------------
 *      문자형
 *      -----------------------------------
 *      실수형
 *      ----------------------------------
 *      참조형 : 데이터를 여러개 한번에 저장하는 방법 
 *                ex) 배열/클래스
 *      
 * 
 * 4. 각 데이터형별 사용법
 * 5. 연산처리 => 제어
 */
public class 변수_2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
