/* 책 중요 페이지
 *  25 page
 *     변수/상수
 *  26 page
 *   1) 형식
 *   2) 식별자
 *  28 page
 *   1) 변수 초기화 
 *  30 page
 *   1) 데이터형 
 * ----------------- 암기
 *  => 변수, 식별자, 데이터형, 변수 초기화
 *  
 *  사용자 요청 처리
 *  38    page => 산술연산자
 *  41    page => 복합대입연산자, 증감연산자
 *  44    page => 비교연산자
 *  45    page => 논리연산자
 *  48    page => 조건연산자
 *  50~51 page => 형변환
 *  --------------------------------- 프로그램을 잘 짜고 싶다 : 가장 기본이 되는 변수설정, 연산자, 제어문은 확실하게 공부해야 한다. 
 *  변수를 응용 -> 연산자
 *  연산자를 응용 -> 제어문
 *  제어문을 응용 -> 메소드
 *  메소드를 응용 -> 클래스
 *  
 */
public class 교재_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
