package com.sist.main;
/*
 * 	변수 / 메소드 / 생성자
 * ----------------------
 * 	접근 범위
 * 	=> private : 멤버변수(데이터를 보호하는 목적) => 접근 거부
 *  => public : 다른 클래스 연결              => 접근 승낙
 *              메소드 / 클래스 / 생성자 
 *  라이브러리에서 제공
 *  (접근지정어는 멤버에서만 사용이 가능하다(다른 클래스에서 사용이 가능하기 때문에 접근 범위를 지정해줘야 한다))
 *  		   --- 클래스영역에 선언된 것들
 *             --- 인스턴스 변수, 정적변수
 *             --- 메소드
 *             --- 생성자
 *             --- 클래스
 *             ** 지역변수는 접근 지정어를 사용할 수 없다 (메소드 안에서만 사용하기 때문에)	
 *             ** final은 접근지정어와 static 을 사용할 수 없다
 *  ----------------------------------------------------
 *  ★private : 자신의 클래스에서만 사용이 가능 (접근 금지) ex) 개인정보, 회사정보...	
 *   		  -> 기본적으로 모든 멤버변수는 데이터보호를 위해 private를 사용한다
 *  ----------------------------------------------------            
 *   default : 같은 패키지에서 접근이 가능 => 키워드가 없는 상태
 *   			ex) class A
 *   				{
 *   					int a; ==> default
 *   				}
 *  ----------------------------------------------------
 *   protected : 같은 패키지에서 접근이 가능 + 상속을 받은 경우 다른 패키지까지 접근이 가능
 *  ----------------------------------------------------
 *  ★public : 모든 클래스에서 접근이 가능하게 만든다.
 *  		 클래스, 메소드, 인터페이스, 상수, 생성자 등 가능
 *  ----------------------------------------------------
 *   적용범위 비교
 *    =>  private < default < protected < public 
 * 
 *  	** 지역변수는 final외에 다른 키워드는 사용이 불가능하다.
 *  	** 멤버변수는 기본 초기화가 되어서 바로 사용이 가능하다.
 *             		--------- 프로그램에 필요한 경우에는 초기화 후 사용한다.
 *               초기화가 필요 없으면 생성자나 초기화블록을 사용하지 않아도 된다.
 *               생성자를 생략하게 되면 자동으로 추가 된다.
 *     	   지역변수는 반드시 초기화를 한 후 사용해야 한다.
 * 		** 모든 멤버변수에 private를 꼭 사용해야 하는 것이 아니다. 권장사항이다. 
 * 
 *   메소드 : 기능 수행
 * 		형식) 
 * 			[접근지정어][옵션] 리턴형 메소드명(매개변수목록)
 * 			          -----
 * 						static,  abstract
 * 						------ 클래스에서 모든 영역에 공통 적용
 * 			--------- 다른 클래스와 통신 => public
 * 			{
 * 				--- 사용자 요청에 대한 처리
 * 					결과값 전송 => return
 *          }
 *          
 *           1. 접근지정어
 *              메소드 => 통신 담당 (소프트웨어 => 메세지) ==> 클래스와 클래스를 연결 => 모든 클래스에서 사용이 가능
 *                       public 
 *                 ** 메소드명 : 식별자 => 소문자 시작 (가급적이면 한글은 사용하지 않는다 => 운영체제에 따라 한글인식이 다르기 때문)       
 *              옵션 => static : 클래스 전체에서 동일한 기능을 가지고 있는 경우 (극히 드물다 => 프로그램에서 1~2개정도)
 *              		         ex)   (웹) 한글 변환, 암호화, 복호화
 *              리턴형 => 기본형, 배열, 클래스
 *              		  |     |     └정보출력 (변수가 여러개인 경우) ex) 상세보기
 *                        |     └전송하는 데이터가 여러개 ex) 목록
 *                        └데이터값이 한개인 경우 ex) 장바구니의 개수 
 *              매개변수 => 여러개 사용이 가능 => 3개 이상 초과 금지 (이때는 배열, 클래스를 사용하는게 좋다)
 *                        사용자가 보내주는 요청값의 개수를 모르는 경우 ==> ... => 가변형매개변수                
 * 				** 리턴형 (요청에 대한 결과값)
 *              ** 매개변수 (사용자 요청한 값) => 로그인 요청 (ID, PWD) , 검색 (검색어)
 *              ** 메소드는 호출하게 되면 처음부터 끝까지 수행한다
 *                 -------------------------------------
 *                 { => 시작
 *                 			
 *                 } <= 끝
 *                 -----------------------> 반복 제거
 *                 -----------------------> 재사용 용이
 *                 -----------------------> 구조적인 프로그램 (단락) => 수정, 추가
 *                 
 *       호출) 
 *          => 인스턴스는 객체를 먼저 생성후 객체명.변수명 형식으로 호출/ 객체명.메소드명
 *               구분자는 메모리 주소인데 객체명이 구분자를 가지고 있다.
 *          => static은 클래스명.변수명 / 클래스명.메소드명 형식으로 호출
 *               구분자는 클래스명이 가지고 있다.
 *           class A
 *           {
 *           	int a = 10;
 *           	--------------------
 *              static b=20; // 저장됨
 *              ----------------------
 *           	public void aaa(){}
 *              public int bbb(){}
 *              -----------------------------
 *              public static void ccc(){} // 저장됨 
 *              public static int ddd(){} // 저장됨
 *              -----------------------------
 * 	          }
 * 					A aa=new A()
 * 					
 * 					--aa--
 * 					 0x100
 *                  ------  =>  0x100 -------------
 *                                      10 => a  ==> aa.a
 *                                    -------------
 *                                       aaa() ==> aa.aaa()
 *                                    -------------
 *                                       bbb() ==> aa.bbb()
 *                                    -------------        
 *        ========== A ===========       
 *            ----------------
 *               20 ===> b   => A.b
 *            ----------------
 *                 ccc()     => A.ccc
 *            ----------------
 *                 ddd()     => A.ddd
 *            ----------------
 *       =========================                                     
 *                                    
 */

public class 클래스_접근지정어 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
